backbone:
  [[-1, 1, Conv, [16, 3, 2, None, 1, nn.Hardswish()]],
   
   [-1, 1, Block, [3, 16, 16, 16, nn.ReLU(), False, 1]],
   [-1, 1, Block, [3, 16, 64, 24, nn.ReLU(), False, 2]],
   [-1, 1, Block, [3, 24, 72, 24, nn.ReLU(), False, 1]],
   [-1, 1, Block, [5, 24, 72, 40, nn.ReLU(), True, 2]],
   [-1, 1, Block, [5, 40, 120, 40, nn.ReLU(), True, 1]],
   [-1, 1, Block, [5, 40, 120, 40, nn.ReLU(), True, 1]],         # 6
   [-1, 1, Block, [3, 40, 240, 80, nn.Hardswish(), False, 2]],
   [-1, 1, Block, [3, 80, 200, 80, nn.Hardswish(),False, 1]],
   [-1, 1, Block, [3, 80, 184, 80, nn.Hardswish(),False, 1]],
   [-1, 1, Block, [3, 80, 184, 80, nn.Hardswish(),False, 1]],
   [-1, 1, Block, [3, 80, 480, 112, nn.Hardswish(),True, 1]],
   [-1, 1, Block, [3, 112, 672, 112, nn.Hardswish(),True, 1]],   # 12
   [-1, 1, Block, [5, 112, 672, 160, nn.Hardswish(),True, 2]],
   [-1, 1, Block, [5, 160, 672, 160, nn.Hardswish(),True, 1]],
   [-1, 1, Block, [5, 160, 960, 160, nn.Hardswish(),True, 1]],   # 15
  ]

neck:
  [[-1, 1, Conv, [80, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 12], 1, Concat, [1]], # cat backbone P4
   [-1, 3, C3, [80, False]], # 19

   [-1, 1, Conv, [40, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 6], 1, Concat, [1]], # cat backbone P3
   [-1, 3, C3, [40, False]], # 23 (P3/8-small)

   [-1, 1, Conv, [40, 3, 2]],
   [[-1, 20], 1, Concat, [1]], # cat head P4
   [-1, 3, C3, [80, False]], # 26 (P4/16-medium)

   [-1, 1, Conv, [80, 3, 2]],
   [[-1, 16], 1, Concat, [1]], # cat head P5
   [-1, 3, C3, [160, False]], # 29 (P5/32-large)
  ]

head:
  [[[23, 26, 29], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
