backbone:
  [[-1, 1, WTA, [320, 4, 4, 3]],
   
   [-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P1/2  
   
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 2-P2/4    
   
   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 8
   
   [-1, 1, MP, []],  # 8-P3/8
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 15
   
   [-1, 1, MP, []],  # 15-P4/16
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 22
   
   [-1, 1, MP, []],  # 22-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 29
  ]

neck:
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU()]], # 30
   
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU()]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [22, 1, Conv, [128, 1, 1, None, 1, nn.ReLU()]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, EDFA, [128, 40]],                       # 35
   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU()]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [15, 1, Conv, [64, 1, 1, None, 1, nn.ReLU()]],  # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, EDFA, [64, 80]],                        # 40
   
   [-1, 1, Conv, [128, 3, 2, None, 1, nn.ReLU()]],
   [[-1, 35], 1, Concat, [1]],
   
   [-1, 1, EDFA, [128, 40]],                       # 43
   
   [-1, 1, Conv, [256, 3, 2, None, 1, nn.ReLU()]],
   [[-1, 30], 1, Concat, [1]],
   
   [-1, 1, EDFA, [256, 20]],                       # 46
  ]

head:
  [[40, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [43, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [46, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   
   [[47,48,49], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
